app/controllers/demandes_controller.rb

  def index
    @demandes = Demande.all
---
SELECT "demandes".* FROM "demandes"

  def create
    # p 'les paramètres reçus', demande_params
    # demande_params << utilisateur_id: session[:user]['id']
    @demande = Demande.new(demande_params.merge(:utilisateur_id=>session[:user]['id']))
    if @demande.save
---
INSERT INTO "demandes" ("utilisateur_id", "debut", "fin", "nb_jours", "type_conges", "motif", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"